# Curve Element Get Line Style Ids Method

Source: https://www.revitapidocs.com/2026/3e30d0b4-6c74-18bf-043f-2430ff9ac17b.htm

---

| Curve Element Get Line Style Ids Method |
| --- |

Ids of all line style Elements that are applicable to this curve element.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ICollection<ElementId> GetLineStyleIds()
```

```
Public Function GetLineStyleIds As ICollection(Of ElementId)
```

```
public:
ICollection<ElementId^>^ GetLineStyleIds()
```

```
member GetLineStyleIds : unit -> ICollection<ElementId>
```

#### Return Value

ICollection ElementId
A collection of Ids of line style elements. Remarks The elements are of the \[!:Autodesk::Revit::DB::GraphicsStyle] class. See Also

#### Reference

CurveElement Class Autodesk.Revit.DB Namespace